app/views/profiles/applicants.html.erb

<% @applications.each do |a|%>
        <% post=Post.find(a.post_id)%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]