app/views/profiles/completed.html.erb

SELECT "skills".* FROM "skills" WHERE "skills"."post_id" = ?  [["post_id", 29]]
---
            <h4>Skills Required</h4>
            <% post.skills.each do |skill|%>