app/views/applicants/index.html.erb

    <h4>Applicant Name</h4>
    <%= Profile.find(app.profile_id).name%><br>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]