app/views/posts/edit.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
---
<%= Post.find(params[:id]).requirement%>