app/views/posts/index.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% if params[:commit] =="search"%>
    <%@profile = Profile.find(session[:id])%>

SELECT "skills".* FROM "skills" WHERE "skills"."post_id" = ?  [["post_id", 28]]
---
            <h4>Skills Required</h4>
            <% post.skills.each do |skill|%>