app/controllers/applicants_controller.rb

  def index

    @applicants = Applicant.where(post_id: params[:post_id])
---
SELECT "applicants".* FROM "applicants" WHERE "applicants"."post_id" = ? AND "applicants"."id" = ? LIMIT ?  [["post_id", 21], ["id", 2], ["LIMIT", 1]]

  def show

    @app = Applicant.find(params[:id])
    @app.astatus = 'hired'
    @app.save

    @post =Post.find(params[:post_id])
    @post.seller_id =  @app.profile_id
    @post.pstatus = 'closed'
    @post.progress = 'pending'
    @post.save
---
SELECT "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "applicants" SET "updated_at" = ?, "astatus" = ? WHERE "applicants"."id" = ?  [["updated_at", "2022-08-16 10:48:29.320409"], ["astatus", 0], ["id", 15]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "posts" SET "seller_id" = ?, "updated_at" = ?, "pstatus" = ?, "progress" = ? WHERE "posts"."id" = ?  [["seller_id", 1], ["updated_at", "2022-08-18 06:25:05.653108"], ["pstatus", 1], ["progress", 1], ["id", 29]]

  def create
    @applicant = Applicant.create(profile_id:params[:profile_id],post_id: params[:post_id])
---
INSERT INTO "applicants" ("profile_id", "post_id", "created_at", "updated_at", "astatus") VALUES (?, ?, ?, ?, ?)  [["profile_id", 1], ["post_id", 29], ["created_at", "2022-08-18 06:23:45.871147"], ["updated_at", "2022-08-18 06:23:45.871147"], ["astatus", nil]]