app/controllers/posts_controller.rb

  def index
    if params[:commit] != "search"
      @profile =  Profile.find(params[:profile_id])
      session[:id] = @profile.id
    end
    if params[:commit] == "search"
      @skills = Skill.where("name LIKE ?","%#{params[:name]}%")
      @posts = []
      @skills.each do |i|
        @posts<<i.post
      end
    elsif @profile.role == "buyer"
      @posts =  Profile.find(params[:profile_id]).posts
    else
      @posts = Post.all
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "skills".* FROM "skills" WHERE "skills"."post_id" = ?  [["post_id", 23]]
SELECT "skills".* FROM "skills" WHERE (name LIKE '%Ruby%')
INSERT INTO "posts" ("requirement", "budget", "description", "seller_id", "buyer_id", "profile_id", "created_at", "updated_at", "pstatus") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."profile_id" = ?  [["profile_id", 3]]

  def show

    @post  = Post.find(params[:id])
    @post.progress = 'completed'
    @post.save
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = ?, "progress" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-08-18 06:25:41.053366"], ["progress", 0], ["id", 29]]
SELECT "posts".* FROM "posts"

  def create

    @profile = Profile.find(params[:profile_id])
    @post = @profile.posts.create(post_params)
    @post.buyer_id = params[:profile_id]
    @post.save
    profile = Profile.find(params[:profile_id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("requirement", "budget", "description", "seller_id", "buyer_id", "profile_id", "created_at", "updated_at", "pstatus", "progress", "rate") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "posts" SET "buyer_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["buyer_id", 2], ["updated_at", "2022-08-18 06:21:47.006065"], ["id", 28]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def review
    @posts = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

  def rate
    @post =Post.find(params[:id])
    @post.rate = params[:rate]
    @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = ?, "rate" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-08-18 06:26:16.092061"], ["rate", 5], ["id", 29]]

  def search

    @skills = Skill.where("name LIKE ?","%#{params[:name]}%")
---
SELECT "skills".* FROM "skills" WHERE "skills"."post_id" = ?  [["post_id", 26]]