app/controllers/profiles_controller.rb

  def applicants
    @applications= Applicant.where(params[:profile_id])
---
SELECT "applicants".* FROM "applicants" WHERE (4)

  def create

    @profile  = Profile.create!(profile_params)
---
INSERT INTO "profiles" ("hired_freelacers", "name", "phone", "email", "country", "pending_projects", "completed_projects", "created_at", "updated_at", "role", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @profile = Profile.find(:id)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def login

    profile = Profile.find_by(email: params[:email])

  if profile.present? && profile.authenticate(params[:password])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "ashraf.chnt@gmail.com"], ["LIMIT", 1]]

  def closed
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def completed
    @posts = Post.where(seller_id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."profile_id" = ? AND "posts"."seller_id" = ?  [["profile_id", 2], ["seller_id", 2]]