app/controllers/skills_controller.rb

  def create
    @skill = Skill.create(skill_params)
---
INSERT INTO "skills" ("name", "perhourrate", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ROR2"], ["perhourrate", 100], ["post_id", 23], ["created_at", "2022-08-17 07:34:12.923556"], ["updated_at", "2022-08-17 07:34:12.923556"]]